{
  "the": 0,
  "of": 1,
  "to": 2,
  "in": 3,
  "is": 4,
  "and": 5,
  "we": 6,
  "for": 7,
  "that": 8,
  "this": 9,
  "learning": 10,
  "an": 11,
  "which": 12,
  "maxq": 13,
  "can": 14,
  "paper": 15,
  "it": 16,
  "decision": 17,
  "method": 18,
  "be": 19,
  "by": 20,
  "with": 21,
  "on": 22,
  "function": 23,
  "state": 24,
  "policy": 25,
  "as": 26,
  "are": 27,
  "order": 28,
  "from": 29,
  "hierarchical": 30,
  "performance": 31,
  "classifier": 32,
  "data": 33,
  "approach": 34,
  "target": 35,
  "value": 36,
  "conditions": 37,
  "domains": 38,
  "show": 39,
  "analysis": 40,
  "algorithms": 41,
  "complexity": 42,
  "case": 43,
  "hybrid": 44,
  "induction": 45,
  "inductive": 46,
  "logic": 47,
  "programming": 48,
  "tilde": 49,
  "ilp": 50,
  "its": 51,
  "abstractions": 52,
  "algorithm": 53,
  "experimentally": 54,
  "important": 55,
  "actions": 56,
  "under": 57,
  "cost": 58,
  "such": 59,
  "class": 60,
  "robust": 61,
  "clustering": 62,
  "trees": 63,
  "system": 64,
  "tree": 65,
  "examples": 66,
  "setting": 67,
  "reinforcement": 68,
  "based": 69,
  "functions": 70,
  "five": 71,
  "converges": 72,
  "optimal": 73,
  "known": 74,
  "abstraction": 75,
  "representation": 76,
  "has": 77,
  "makes": 78,
  "non": 79,
  "comparison": 80,
  "many": 81,
  "perform": 82,
  "developed": 83,
  "these": 84,
  "dynamics": 85,
  "constructed": 86,
  "thus": 87,
  "natural": 88,
  "one": 89,
  "reference": 90,
  "kolmogorov": 91,
  "well": 92,
  "may": 93,
  "available": 94,
  "computers": 95,
  "real": 96,
  "efficient": 97,
  "techniques": 98,
  "computational": 99,
  "top": 100,
  "down": 101,
  "tic": 102,
  "propositional": 103,
  "two": 104,
  "memory": 105,
  "agent": 106,
  "partially": 107,
  "observable": 108,
  "cross": 109,
  "validation": 110,
  "presents": 111,
  "decomposing": 112,
  "process": 113,
  "mdp": 114,
  "into": 115,
  "hierarchy": 116,
  "smaller": 117,
  "mdps": 118,
  "proves": 119,
  "results": 120,
  "power": 121,
  "use": 122,
  "recursively": 123,
  "even": 124,
  "experiments": 125,
  "possible": 126,
  "finally": 127,
  "related": 128,
  "work": 129,
  "rl": 130,
  "defined": 131,
  "however": 132,
  "space": 133,
  "define": 134,
  "multiplicative": 135,
  "newton": 136,
  "like": 137,
  "situation": 138,
  "where": 139,
  "restricted": 140,
  "orthogonal": 141,
  "group": 142,
  "general": 143,
  "framework": 144,
  "restriction": 145,
  "problem": 146,
  "second": 147,
  "new": 148,
  "convergence": 149,
  "scaling": 150,
  "each": 151,
  "other": 152,
  "coset": 153,
  "point": 154,
  "any": 155,
  "computer": 156,
  "all": 157,
  "binary": 158,
  "strings": 159,
  "standard": 160,
  "only": 161,
  "they": 162,
  "not": 163,
  "depend": 164,
  "more": 165,
  "useful": 166,
  "if": 167,
  "include": 168,
  "calculus": 169,
  "example": 170,
  "some": 171,
  "world": 172,
  "usually": 173,
  "misclassification": 174,
  "costs": 175,
  "systems": 176,
  "build": 177,
  "best": 178,
  "extends": 179,
  "including": 180,
  "also": 181,
  "roc": 182,
  "adapts": 183,
  "allows": 184,
  "clear": 185,
  "empirical": 186,
  "indeed": 187,
  "problems": 188,
  "presented": 189,
  "aim": 190,
  "employs": 191,
  "first": 192,
  "logical": 193,
  "relational": 194,
  "expressive": 195,
  "efficiency": 196,
  "sets": 197,
  "handled": 198,
  "within": 199,
  "mining": 200,
  "main": 201,
  "assumption": 202,
  "interpretations": 203,
  "up": 204,
  "existing": 205,
  "classical": 206,
  "large": 207,
  "implementations": 208,
  "loads": 209,
  "lds": 210,
  "compare": 211,
  "explore": 212,
  "external": 213,
  "technique": 214,
  "overhead": 215,
  "markov": 216,
  "additive": 217,
  "combination": 218,
  "defines": 219,
  "formal": 220,
  "representational": 221,
  "establishes": 222,
  "safe": 223,
  "online": 224,
  "model": 225,
  "free": 226,
  "wih": 227,
  "probability": 228,
  "kind": 229,
  "locally": 230,
  "presence": 231,
  "kinds": 232,
  "evaluates": 233,
  "through": 234,
  "series": 235,
  "three": 236,
  "shows": 237,
  "much": 238,
  "faster": 239,
  "than": 240,
  "flat": 241,
  "fact": 242,
  "learns": 243,
  "benefit": 244,
  "compute": 245,
  "execute": 246,
  "improved": 247,
  "via": 248,
  "procedure": 249,
  "similar": 250,
  "improvement": 251,
  "step": 252,
  "iteration": 253,
  "demonstrates": 254,
  "effectiveness": 255,
  "execution": 256,
  "concludes": 257,
  "discussion": 258,
  "design": 259,
  "tradeoffs": 260,
  "researchers": 261,
  "have": 262,
  "explored": 263,
  "methods": 264,
  "temporal": 265,
  "abstract": 266,
  "primitive": 267,
  "before": 268,
  "terminating": 269,
  "little": 270,
  "about": 271,
  "aspects": 272,
  "ignored": 273,
  "previous": 274,
  "combined": 275,
  "decomposition": 276,
  "prove": 277,
  "successful": 278,
  "application": 279,
  "author": 280,
  "et": 281,
  "al": 282,
  "extended": 283,
  "without": 284,
  "specifying": 285,
  "though": 286,
  "groups": 287,
  "somewhat": 288,
  "complicated": 289,
  "explicit": 290,
  "expression": 291,
  "amount": 292,
  "individual": 293,
  "jumps": 294,
  "obtained": 295,
  "exactly": 296,
  "convergent": 297,
  "global": 298,
  "instability": 299,
  "inherent": 300,
  "remedied": 301,
  "levenberg": 302,
  "marquardt": 303,
  "type": 304,
  "variation": 305,
  "readily": 306,
  "applied": 307,
  "independent": 308,
  "component": 309,
  "remarkable": 310,
  "illustrated": 311,
  "numerical": 312,
  "simulation": 313,
  "construct": 314,
  "scratch": 315,
  "fourth": 316,
  "cumulant": 317,
  "stochastic": 318,
  "variables": 319,
  "updating": 320,
  "rule": 321,
  "here": 322,
  "homogeneous": 323,
  "nature": 324,
  "lie": 325,
  "numerous": 326,
  "merits": 327,
  "rigorous": 328,
  "treatment": 329,
  "consequence": 330,
  "shown": 331,
  "invariant": 332,
  "componentwise": 333,
  "choosen": 334,
  "identifying": 335,
  "points": 336,
  "transformed": 337,
  "assume": 338,
  "our": 339,
  "move": 340,
  "toward": 341,
  "direction": 342,
  "no": 343,
  "prewhitening": 344,
  "required": 345,
  "given": 346,
  "asymptotic": 347,
  "properties": 348,
  "considered": 349,
  "because": 350,
  "do": 351,
  "argue": 352,
  "refined": 353,
  "practical": 354,
  "simple": 355,
  "restrict": 356,
  "interesting": 357,
  "way": 358,
  "modeling": 359,
  "life": 360,
  "limited": 361,
  "physically": 362,
  "us": 363,
  "give": 364,
  "what": 365,
  "might": 366,
  "look": 367,
  "mathematically": 368,
  "restrictions": 369,
  "error": 370,
  "terms": 371,
  "logarithmic": 372,
  "disappear": 373,
  "keywords": 374,
  "algorithmic": 375,
  "information": 376,
  "theory": 377,
  "environments": 378,
  "difficult": 379,
  "specify": 380,
  "operating": 381,
  "precisely": 382,
  "uncertainty": 383,
  "building": 384,
  "classification": 385,
  "problematic": 386,
  "will": 387,
  "at": 388,
  "least": 389,
  "cases": 390,
  "actually": 391,
  "surpass": 392,
  "across": 393,
  "wide": 394,
  "variety": 395,
  "frameworks": 396,
  "optimization": 397,
  "metrics": 398,
  "accuracy": 399,
  "expected": 400,
  "lift": 401,
  "precision": 402,
  "recall": 403,
  "workforce": 404,
  "utilization": 405,
  "store": 406,
  "update": 407,
  "imprecise": 408,
  "distributions": 409,
  "convex": 410,
  "hull": 411,
  "rocch": 412,
  "combines": 413,
  "geometry": 414,
  "them": 415,
  "particulars": 416,
  "analyzing": 417,
  "learned": 418,
  "classifiers": 419,
  "incremental": 420,
  "minimizes": 421,
  "management": 422,
  "visual": 423,
  "comparisons": 424,
  "sensitivity": 425,
  "analyses": 426,
  "evidence": 427,
  "needed": 428,
  "basic": 429,
  "towards": 430,
  "principles": 431,
  "instance": 432,
  "resulting": 433,
  "methodology": 434,
  "implemented": 435,
  "various": 436,
  "both": 437,
  "when": 438,
  "comparing": 439,
  "attribute": 440,
  "there": 441,
  "trade": 442,
  "off": 443,
  "between": 444,
  "typically": 445,
  "but": 446,
  "less": 447,
  "therefore": 448,
  "current": 449,
  "small": 450,
  "according": 451,
  "standards": 452,
  "community": 453,
  "source": 454,
  "inefficiency": 455,
  "lies": 456,
  "several": 457,
  "so": 458,
  "cannot": 459,
  "independently": 460,
  "unnecessary": 461,
  "scale": 462,
  "explain": 463,
  "context": 464,
  "databases": 465,
  "relate": 466,
  "corresponds": 467,
  "multiple": 468,
  "relations": 469,
  "expressiveness": 470,
  "while": 471,
  "maintaining": 472,
  "extent": 473,
  "study": 474,
  "present": 475,
  "alternative": 476,
  "classic": 477,
  "showing": 478,
  "handle": 479,
  "or": 480,
  "mb": 481,
  "scales": 482,
  "linearly": 483,
  "number": 484,
  "necessary": 485,
  "history": 486,
  "observations": 487,
  "stigmergic": 488,
  "ability": 489,
  "set": 490,
  "bits": 491,
  "included": 492,
  "part": 493,
  "input": 494,
  "need": 495,
  "learn": 496,
  "reactive": 497,
  "highly": 498,
  "markovian": 499,
  "domain": 500,
  "sarsa": 501,
  "lambda": 502,
  "had": 503,
  "success": 504,
  "vaps": 505,
  "due": 506,
  "baird": 507,
  "moore": 508,
  "guarantees": 509,
  "benchmark": 510,
  "generally": 511,
  "applicable": 512,
  "often": 513,
  "employed": 514,
  "machine": 515,
  "disadvantage": 516,
  "straightforward": 517,
  "implementation": 518,
  "reduced": 519,
  "significantly": 520,
  "integrating": 521,
  "normal": 522,
  "discuss": 523,
  "how": 524,
  "adapted": 525,
  "provide": 526,
  "speedups": 527,
  "adaptations": 528,
  "yield": 529,
  "supported": 530,
  "experimental": 531
}